#Использовать gui
Перем Форма;
Перем Поле1,Страницы; 
// решаем проблему поиска
Процедура Инициализация()		
	//# Загружаем внешнюю компоненту	
	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();	
	Форма = УправляемыйИнтерфейс.СоздатьФорму();	
	//# Устанавливаем обработку события ПриОткрытии	
	Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
	Форма.Показать();
КонецПроцедуры//# Обработка события первого открытия формы
Процедура ПриОткрытииФормы() Экспорт
	УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
	//# Создание страниц
	Страницы = Форма.Элементы.Добавить("Страницы1", "ГруппаФормы", Неопределено);
	Страницы.Вид = Форма.ВидГруппыФормы.Страницы;	
	Страницы.Заголовок = "Страницы";	
	Страницы.Высота = 120;	
	Страница1 = Форма.Элементы.Добавить("Страница1", "ГруппаФормы", Страницы);
	Страница1.Вид = Форма.ВидГруппыФормы.Страница;	Страница1.Заголовок = "Страница1";
	
	Поле1 = Форма.Элементы.Добавить("ТаблицаФормы1", "ТаблицаФормы", Страница1);
	
	Поле1.Закрепление = 5;	Кнопка = Форма.Элементы.Добавить("КнопкаОбновить", "КнопкаФормы", Неопределено);
	Кнопка.Заголовок = "Обновить";	Кнопка.УстановитьДействие(ЭтотОбъект, "Нажатие", "ПриНажатииНаКнопкуОбновить");	
КонецПроцедуры
Процедура ПриНажатииНаКнопкуОбновить() Экспорт	
	ТЗ = Новый ТаблицаЗначений;	ТЗ.Колонки.Добавить("Тест");
	Нов = ТЗ.Добавить();	Нов.Тест = 1;
	ПолеРасширений = Поле1; 
	// Форма.Элементы.Найти("ТаблицаФормы1");	
	ПровайдерТЗ = Новый Провайдер;
	ПровайдерТЗ.Источник = ТЗ;	
	ПолеРасширений.ПутьКДанным = ПровайдерТЗ;	
	Страницы.Видимость = Ложь;
КонецПроцедуры
Инициализация();