#Использовать gui
Коннектор = Новый COMОбъект("v83.COMConnector");
// Получаем Соединение с базой данных
ПараметрыПодключенияКБазеИсточника = "Srvr=""hyper"";Ref=""DEV_PEREZALIVATOR_DEST"";Usr=""admin"";Pwd=""admin"";UC=""987654321"";";
ПроизвольныйКодСразуПослеВосстановленияБекапа = "ЗаписьЖурналаРегистрации(""ПроизвольныйКодСразуПослеВосстановленияБекапа"", УровеньЖурналаРегистрации.Информация,,,""ПроизвольныйКодСразуПослеВосстановленияБекапа"");";
СоединениеСБазой = Коннектор.Connect(ПараметрыПодключенияКБазеИсточника);

РезультатВыполненияКода = СоединениеСБазой.ВКИП_ВыполнениеКода.ВыполнитьКод(ПроизвольныйКодСразуПослеВосстановленияБекапа);